# #Написать программу которая посчитает сколько 
# # раз встречается один и тот же символ в строке
# str = 'программу которая посчитает сколько'
# a = 'о'
# count = 0
# for i in str:
#     if a == i:
#      count += 1
# print(count)

# #Дано количество секунд. Вывести результат в виде: 
# # дни:часы:минуты:секунды
# sec = int(input(''))
# min, sec = sec // 60, sec % 60
# hour, min = min // 60, min % 60
# day, hour = hour // 24, hour % 24
# print(f"{day}:{hour}:{min}:{sec}")

#Напишите программу, которая принимает на вход число N и 
# выдаёт последовательность из N членов.
#  Пример:Для N = 5: 1, -3, 9, -27, 81
# for i in range(5):
#     print((-3) ** i, end=" ")

#Напишите программу, которая принимает на вход число N и 
# выдаёт последовательность из N членов.
# number = int(input("Введите число: "))
# num = 1
# for i in range(number):
#     print(num, end=" ")
#     num *= -3


